# Basic pandas operations: unique, nunique, sort, islull, apply, pivot_table

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [7]:
df = pd.DataFrame({'col1': [1,2,3,4],'col2': [444,555,666,444],'col3' : ['abc','def','ghi','xyz']})

In [8]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [9]:
### finding unique values in col2

In [14]:
df['col2'].unique()

array([444, 555, 666])

In [15]:
df['col2'].nunique()

3

In [16]:
##Above command is same as finding the length of the returned array

In [18]:
len(df['col2'].unique())

3

In [19]:
## to get value counts

In [21]:
df['col2'].value_counts()  ### we know that 444 is twice in our dataset

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [22]:
## Conditional

In [27]:
df[(df['col1']>1) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

APPLY Method

In [ ]:
## There is apply method when we want to perform some actions on the columns of our dataframe, for ex applying a function

In [29]:
def mult2(x):
    return x*2

In [30]:
mult2(4)

8

In [ ]:
## if haveto use above function with our data

In [32]:
df['col2'].apply(mult2)   ## you can see that we are able to multiply all values in 'col2' with 2.

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [ ]:
## Same could be also modified as a lambda function

In [33]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [34]:
## another example to use built-in function

In [36]:
df['col3'].apply(len)   ## finding length of strings

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [37]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [38]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [39]:
## Sort the data using sort_values

In [41]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [42]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

Create a Pivot table. Pivot table takes 3 inputs: values, index and column)

In [46]:
data={'A': ['foo','foo','foo','bar','bar','bar'],'B': ['one','one','two','two','one','one'],'C': ['x','y','x','y','x','y'],'D': [1,3,2,5,4,1]}

In [47]:
df = pd.DataFrame(data)

In [48]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [51]:
df.pivot_table(values='D',index=['A','B'], columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN